recipes/west-african-peanut-soup.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>West African Peanut Soup</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="james" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/favicon.svg" />
</head>
<body>
<div id="org-div-home-and-up"> <a href="../index.html"> Home </a> </div> <div id="btns"><button id="copy-btn" onclick="copyTicked()"></button> <button id="untick-btn" onclick="untickAll()"></button></div><div id="notify">Copied!</div><div id="content">
<h1 class="title">West African Peanut Soup</h1>
<p>
<a href="http://cookieandkate.com/2013/west-african-peanut-soup/">Original link</a>
</p>

<div id="outline-container-org6255a7c" class="outline-2">
<h2 id="org6255a7c">Ingredients</h2>
<div class="outline-text-2" id="text-org6255a7c">
<ul class="org-ul">
<li>6 cups low sodium vegetable broth</li>
<li>1 medium red onion, chopped</li>
<li>2 tablespoons peeled and minced fresh ginger</li>
<li>4 cloves garlic, minced</li>
<li>1 teaspoon salt</li>
<li>1 bunch collard greens (or kale), ribs removed and leaves chopped into 1-inch strips</li>
<li>0.75 cup unsalted peanut butter (chunky or smooth)</li>
<li>0.5 cup tomato paste*</li>
<li>Hot sauce, like sriracha (AKA rooster sauce)</li>
<li>0.25 cup roughly chopped peanuts, for garnish</li>
</ul>
</div>
</div>

<div id="outline-container-org9741d77" class="outline-2">
<h2 id="org9741d77">Method</h2>
<div class="outline-text-2" id="text-org9741d77">
<ol class="org-ol">
<li>In a medium Dutch oven or stock pot, bring the broth to a boil. Add the onion, ginger, garlic and salt. Cook on medium-low heat for 20 minutes.</li>
<li>In a medium-sized, heat-safe mixing bowl, combine the peanut butter and tomato paste, then transfer 1 to 2 cups of the hot stock to the bowl. Whisk the mixture together until smooth, then pour the peanut mixture back into the soup and mix well. Stir in the collard greens and season the soup with hot sauce to taste.</li>
<li>Simmer for about 15 more minutes on medium-low heat, stirring often. Serve over cooked brown rice if you'd like, and top with a sprinkle of chopped peanuts.</li>
</ol>
</div>
</div>
</div>
</body>
</html>
